<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta name="generator" content="ScreenSteps http://www.screensteps.com/" />
	<title>Laguna de las ranas</title>
	<link href="css/blue.css" media="screen" rel="stylesheet" type="text/css" />
	<link href="css/prettyPhoto.css" media="screen" rel="stylesheet" type="text/css" charset="utf-8" />
	<script src="js/jquery-1.3.2.min.js" type="text/javascript" charset="utf-8"></script>
  <script src="js/jquery.prettyPhoto.js" type="text/javascript" charset="utf-8"></script>
  <script type="text/javascript" charset="utf-8">
  		$(document).ready(function(){
  			$("a[rel^='prettyPhoto']").prettyPhoto({
  			  show_title: false
  			}); 
  		}); 	
  	</script>
</head>

<body class="lucida">
	<div id="wrapper">		
		<div id="LessonContent">
			<div class="LessonHeader">
				<h1 class="LessonTitle">Laguna de las ranas</h1>
			</div>
				<div class="summary">
		<p>El sitio web  &ldquo;<a href="https://cienciascontic.github.io/NetTango/examples/FrogPond/web/intro.html" target="_blank">Laguna de las ranas</a>&rdquo; (LdlR), es un entorno digital que permite simular un ecosistema y alterar diferentes variables a partir de la programaci&oacute;n por bloques de una poblaci&oacute;n de ranas. A partir de la programaci&oacute;n, la poblaci&oacute;n de ranas ir&aacute; cambiando de acuerdo a las acciones y comportamientos que el usuario haya programado. La programaci&oacute;n se realiza dentro del sitio web, donde est&aacute; insertado un programa computacional del tipo simulador (o m&aacute;s correctamente &ldquo;modelo de simulaci&oacute;n computacional&rdquo;) que se ejecuta directamente en el navegador web, sin necesidad de instalar ninguna aplicaci&oacute;n ni software espec&iacute;fico (necesita conexi&oacute;n a internet).</p>	
	</div>
			
				<div id="step_1" class="lessonStep top">
	        <h2 class="StepTitle">Comprender el funcionamiento del sitio web &quot;Laguna de las ranas&quot;</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533751447316.png" width="441" height="449" alt="" />
</div> <div class="instructions">
  <p>Primera parte de la pantalla principal del sitio "Laguna de las ranas".</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_2" class="lessonStep top">
	        <h2 class="StepTitle">Parte inferior de la pantalla principal del sitio web &quot;Laguna de las ranas&quot;</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533751543735.png" width="428" height="513" alt="" />
</div> <div class="instructions">
  <p>Al recorrer la p&aacute;gina principal del sitio hacia abajo, veremos las diferentes secciones: Introducci&oacute;n; Selecci&oacute;n natural; Programando ranas; y Desaf&iacute;os.</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_3" class="lessonStep top">
	        <h2 class="StepTitle">Sección: &quot;Programando ranas&quot;</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533751915901.png" width="560" height="471" alt="" />
</div> <div class="instructions">
  <p>En la p&aacute;gina principal del sitio web tenemos la secci&oacute;n "Programando ranas" que muestra un simulador para programar las ranas. Para ahorrarnos trabajo en nuestro primer acercamiento, las ranas ya tienen un comando para comenzar a ejecutar: el comando "saltar", acompa&ntilde;ado de un n&uacute;mero que indica la cantidad de pasos que saltar&aacute;n las ranas. En las secciones siguientes veremos c&oacute;mo podemos agregar otros comandos para programar nuestras ranas para que realicen acciones un poco m&aacute;s interesantes y divertidas que solamente saltar.</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_4" class="lessonStep top">
	        <h2 class="StepTitle">Cómo programar las ranas para que hagan otras cosas además de &quot;saltar un paso&quot;</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533745473366.png" width="438" height="330" alt="" />
</div> <div class="instructions">
  <p>Para programar las ranas debemos simplemente arrastrar los bloques que representan las acciones y comportamientos hasta dentro del bloque "Comenzar". Al ejecutar la simulaci&oacute;n (ver paso siguiente), cada una de las ranas comenzar&aacute; a ejecutar los comandos en orden secuencial de arriba hacia abajo una y otra vez. La ejecuci&oacute;n se detendr&aacute; cuando la poblaci&oacute;n se haya extinguido (o sea que no queden m&aacute;s ranas) o cuando decidamos detenerla nosotros con el bot&oacute;n correspondiente.</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_5" class="lessonStep top">
	        <h2 class="StepTitle">Cómo iniciar el programa para ver las ranas cumpliendo las órdenes que les dimos</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533745924131.png" width="560" height="318" alt="" />
</div> <div class="instructions">
  <p>Una vez ubicados los comandos correspondientes a las acciones que deseamos que realicen nuestras ranas, debemos dar clic en el tri&aacute;ngulo blanco para comenzar la ejecuci&oacute;n de la simulaci&oacute;n. Observar la flecha amarilla que marca el orden en que se ejecutar&aacute;n las acciones, o sea: primero girar a la izquierda 60 grados, luego saltar y luego se comienza de nuevo con la primer acci&oacute;n.</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_6" class="lessonStep top">
	        <h2 class="StepTitle">Programar diferentes acciones y comportamientos de las ranas</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533752971428.png" width="560" height="511" alt="" />
</div> <div class="instructions">
  <p>Si bien las acciones que pueden realizar las ranas son simples, tambi&eacute;n es posible dotar a dichas acciones de cierta variedad. Por ejemplo, pueden realizar saltos m&aacute;s largos o m&aacute;s cortos; girar a un lado o a otro con un determinado &aacute;ngulo (medido en grados) o cazar durante per&iacute;odos de tiempo diferentes. Adem&aacute;s de poder especificarle cu&aacute;n largos queremos que sean los saltos o cu&aacute;n abiertos o cerrados sean los giros de las ranas, podemos hacer que las ranas cumplan con estas acciones un n&uacute;mero al azar. &iquest;C&oacute;mo? En la siguiente secci&oacute;n lo explicamos.</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_7" class="lessonStep top">
	        <h2 class="StepTitle">Cómo agregar aleatoriedad a los movimientos de nuestras ranas</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533755591565.png" width="560" height="592" alt="" />
</div> <div class="instructions">
  <p>Si marcamos la casilla "aleatorio?" al momento de configurar cu&aacute;ntos grados queremos que las ranas giren a la izquierda, nuestras ranas girar&aacute;n (cada vez) hacia la izquierda una cantidad de grados diferente, entre 0 y 180. O sea, si nosotros le decimos que gire 10 grados hacia la izquierda siempre lo har&aacute; as&iacute;, pero si marcamos "aleatorio?" con un tilde, entonces una vez girar&aacute; 1 grado, otra vez 123, otra vez 80, etc. Esto es lo que se conoce como car&aacute;cter aleatorio o al azar. Podr&iacute;amos imaginar esto como si cada vez que la rana fuera a saltar tirara un dado de 181 caras, donde cada vez puede salir un n&uacute;mero diferente entre 0 y 180 (incluyendo a ambos).</p>


<p>Lo mismo sucede con la cantidad de segundos que podemos hacer que nuestras ranas cacen. El tiempo en la acci&oacute;n "cazar" funciona de la siguiente manera: cada vez que una rana lee esa acci&oacute;n, lo que hace es extender su lengua (larga y pegajosa) durante una cantidad de tiempo determinado a la espera de que pase por all&iacute; una lib&eacute;lula y poder engullirla. O sea que cuanto m&aacute;s largo sea el tiempo en que tienen extendida su lengua, mayor ser&aacute; la probabilidad de atrapar su alimento (lib&eacute;lulas en este caso).<br />
El tiempo de caza puede configurarse entre 1 y 10 segundos. Cuando las ranas est&aacute;n cazando, se ve como un haz de luz durante el tiempo indicado. Si dentro de ese lapso pasa por all&iacute; una lib&eacute;lula (las lib&eacute;lulas se mueven al azar por la laguna), entonces la rana despliega su lengua roja y pegajosa y as&iacute; atrapa y engulle la lib&eacute;lula (ver figura de arriba).</p>
</div>
	</div>
	<div class="clear"></div>
	<div id="step_8" class="lessonStep top">
	        <h2 class="StepTitle">Comportamiento condicional en ranas</h2>
		<div class="image">
<img src="images/Laguna_de_las_ranas/media_1533756352179.png" width="452" height="286" alt="" />
</div> <div class="instructions">
  <p>Hasta ahora ven&iacute;amos dici&eacute;ndole a nuestras ranas que ejecutaran determinadas acciones como saltar, girar a la izquierda o cazar, y ellas cumpl&iacute;an nuestras &oacute;rdenes a rajatabla sin importarles nada. Y a nosotros tampoco nos importaba demasiado cu&aacute;les fueran las consecuencias de dichas acciones sobre la poblaci&oacute;n de ranas. Pero, &iquest;qu&eacute; pasar&iacute;a si quisi&eacute;ramos que a trav&eacute;s de las acciones que programamos la poblaci&oacute;n de ranas tuviera un cierto comportamiento? En ese caso querr&iacute;amos que ante determinadas condiciones las ranas se comportaran de una manera determinada pero si las condiciones son otras ese comportamiento fuera diferente. Para eso existen, en la programaci&oacute;n (y en la vida) lo que llamamos "condicionales". Los condicionales nos acompa&ntilde;an en todo momento en nuestra vida, todo el tiempo estamos decidiendo sobre si levantarnos o seguir durmiendo, tomar agua o gaseosa, viajar en tren o subte, etc. Para poder tomar decisiones frente a determinadas situaciones, nuestras ranas cuentan con el bloque condicional "Si ___". Este bloque act&uacute;a de manera que si se cumple la condici&oacute;n indicada la rana modifica su comportamiento.</p>
</div>
	</div>
	<div class="clear"></div>

		</div>
	</div>	
</body>
</html>
